In [22]:
import pandas as pd
import numpy as np

In [19]:
# crear dataframe de diccionario anidado de diccionarios

data_1 = {"Monterrey":{"1990":10.0,"2000":11.0,"2010":12.0,"2020":13.0}}
data_2 = {"Chihuahua":{"1990":12.0,"2000":14.0,"2010":15.0,"2020":15.0}}
data_3 = {"Queretaro":{"1990":13.0,"2000":12.0,"2010":18.0,"2020":12.0}}
data_4 = {"Pachuca":{"1990":15.0,"2000":17.0,"2010":17.0,"2020":19.0}}
data_5 = {"Pachuca":{"1991":15.0,"2001":17.0,"2011":17.0,"2021":19.0}}

# unir varios diccionarios en uno solo
all_data = data_1 | data_2 | data_3 | data_4 | data_5
# crear el dataframe
df = pd.DataFrame(all_data)
# replace Nan values for 0.0
df = df.fillna(0.0)
df

      Monterrey  Chihuahua  Queretaro  Pachuca
1990       10.0       12.0       13.0      0.0
2000       11.0       14.0       12.0      0.0
2010       12.0       15.0       18.0      0.0
2020       13.0       15.0       12.0      0.0
1991        0.0        0.0        0.0     15.0
2001        0.0        0.0        0.0     17.0
2011        0.0        0.0        0.0     17.0
2021        0.0        0.0        0.0     19.0

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, 1990 to 2021
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Monterrey  8 non-null      float64
 1   Chihuahua  8 non-null      float64
 2   Queretaro  8 non-null      float64
 3   Pachuca    8 non-null      float64
dtypes: float64(4)
memory usage: 620.0+ bytes

In [14]:
# transponer filas y columnas
df_t = df.T

In [15]:
df_t.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Monterrey to Pachuca
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   1990    4 non-null      float64
 1   2000    4 non-null      float64
 2   2010    4 non-null      float64
 3   2020    4 non-null      float64
 4   1991    4 non-null      float64
 5   2001    4 non-null      float64
 6   2011    4 non-null      float64
 7   2021    4 non-null      float64
dtypes: float64(8)
memory usage: 460.0+ bytes

In [19]:
# Establecer el atributo name a el index y a las columnas
df.index.name = "Estados"
df.columns.name = "Years"
print(df.index.name)

Estados

In [20]:
df

Years    Monterrey  Chihuahua  Queretaro  Pachuca
Estados
1990          10.0       12.0       13.0      0.0
2000          11.0       14.0       12.0      0.0
2010          12.0       15.0       18.0      0.0
2020          13.0       15.0       12.0      0.0
1991           0.0        0.0        0.0     15.0
2001           0.0        0.0        0.0     17.0
2011           0.0        0.0        0.0     17.0
2021           0.0        0.0        0.0     19.0

In [20]:
# append nuevos indices a el index
df.index.append(pd.Index([2022,2024]))

Index(['1990', '2000', '2010', '2020', '1991', '2001', '2011', '2021', 2022,
       2024],
      dtype='object')

In [18]:
df

Index(['1990', '2000', '2010', '2020', '1991', '2001', '2011', '2021', 2022,
       2024],
      dtype='object')

In [25]:
# Creacion de datafram con metodo de nunmpy
df_data = pd.DataFrame(np.arange(9).reshape((3,3)),
                        index = ["a","c","d"],
                        columns = ["Ohio","Texas","California"])

In [26]:
df_data

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [27]:
# reindexacion de filas
df_data.reindex(index=["a","b","c","d"])

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [28]:
# reindexacion de columnas
states = ["Texas","Utha","California"]
df_data.reindex(columns=states)
# como 'Ohiio' no estaba en states, queda fuera del resultado

   Texas  Utha  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [38]:
# otra forma de reindexar es pasar los nombres de las etiquetas como
# un argumento posicional

# crear nuevo dataframe
df_meses = pd.DataFrame(np.arange(12).reshape((4,3)),
                        index = ["a","b","c","d"],
                        columns= ["ENE","FEB","MAR"])
new_months = ["FEB","MAR","ABR"]
new_index = ["a","b","d","e","f"]
# pasar el reindexado mediante argumento posicional
df_meses = df_meses.reindex(new_months,axis="columns")
df_meses = df_meses.reindex(new_index,axis="index")
df_meses = df_meses.fillna(0)
df_meses

    FEB   MAR  ABR
a   1.0   2.0  0.0
b   4.0   5.0  0.0
d  10.0  11.0  0.0
e   0.0   0.0  0.0
f   0.0   0.0  0.0